app/views/calls/_form.html.erb

    <%= f.label :client_id, I18n.t('client') %><br>
    <%= f.collection_select(:client_id, Client.all, :id, :company_name, prompt: true) %>
---
SELECT `clients`.* FROM `clients`