app/views/calls/index.html.erb

                    <td><%= call.next_call.strftime("%d/%m/%Y") %></td>
                    <td><%= call.client.blank? ? "-" : call.client.company_name %></td>
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1