app/views/calls/show.html.erb

SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
---
            <strong><%= I18n.t('client') %>:</strong>
            <%= @call.client.blank? ? "-" : @call.client.company_name %>