app/views/clients/show.html.erb

SELECT `calls`.* FROM `calls` WHERE `calls`.`client_id` = 1
---
                  <tbody>
                    <% @client.calls.each do |call| %>