app/controllers/appointments_controller.rb

SELECT `appointments`.* FROM `appointments`
---
  def index
    @appointments = Appointment.all

SELECT `clients`.* FROM `clients`
---
  def new
    @appointment = Appointment.new
    @clients = Client.all