app/controllers/calls_controller.rb

SELECT `calls`.* FROM `calls`
---
  def index
    @q = Call.ransack(params[:q])
    @calls = @q.result.includes(:client)

SELECT  `calls`.* FROM `calls` WHERE `calls`.`id` = 1 LIMIT 1
---
  def show
    @call = Call.find(params[:id])

SELECT  `calls`.* FROM `calls` WHERE `calls`.`id` = 1 LIMIT 1
---
  def edit
    @call = Call.find(params[:id])

INSERT INTO `calls` (`call_date`, `details`, `interest_level`, `next_call`, `annotation`, `client_id`, `created_at`, `updated_at`) VALUES ('2016-10-05 10:58:00', 'Detalhes', '3', '2016-10-05', '121321', 1, '2016-10-05 10:58:40', '2016-10-05 10:58:40')
---
  def create
    @call = Call.new(call_params)

    respond_to do |format|
      if @call.save

SELECT `clients`.* FROM `clients`
---
    def set_client
      @clients = Client.all