app/controllers/clients_controller.rb

SELECT `clients`.* FROM `clients`
---
  def index
    @clients = Client.all

INSERT INTO `clients` (`company_name`, `address`, `contact_person`, `phone_number`, `mobile_number`, `email`, `website`, `created_at`, `updated_at`) VALUES ('Empresa', 'Rua', 'Contato', '13874', '237840', 'ajsiod@fokd', 'wme.com', '2016-10-05 10:57:40', '2016-10-05 10:57:40')
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save

DELETE FROM `clients` WHERE `clients`.`id` = 4
---
  def destroy
    @client.destroy

SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 4 LIMIT 1
---
    def set_client
      @client = Client.find(params[:id])