app/views/appointments/_form.html.erb

SELECT `clients`.* FROM `clients`
---
    <%= f.label :client_id, I18n.t('client') %><br>
    <%= f.collection_select(:client_id, Client.all, :id, :company_name, prompt: true) %>